<template>
    <div class="footer">
        <div class="container">
            <div class="row">
                <div class="col-md-12 col-sm-12">
                    <div class="white-color">{{year}}, Koa2 Vue2 StarterKit</div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>

    export default {
        name: 'main-footer',
        data() {
            return {
                year: (new Date()).getFullYear()
            }
        }
    }
</script>

<i18n>
    {
    "ru": {
    "Служба заботы о пользователях": "Служба заботы о пользователях",
    "Все права защищены": "Все права защищены",
    "возврата средств": "возврата средств",
    "для застройщиков": "для застройщиков",
    "Википедия": "Википедия",
    "Реклама на сайте": "Реклама на сайте",
    "Компания": "Компания",
    "Помощь": "Помощь",
    "Карта сайта": "Карта сайта",
    "о": "о",
    "с": "с",
    "Политика конфиденциальности": "Политика конфиденциальности",
    "Мобильное приложение": "Мобильное приложение",
    "Помощь по сайту": "Помощь по сайту",
    "Предложения для риелторов и агентств недвижимости": "Предложения для риелторов и агентств недвижимости",
    "Безопасные сделки": "Безопасные сделки"
    },
    "uk": {
    "Служба заботы о пользователях": "Служба турботи про користувачів",
    "Все права защищены": "Всі права захищено",
    "возврата средств": "повернення коштів",
    "для застройщиков": "для забудовників",
    "Википедия": "Вікіпедія",
    "Карта сайта": "Мапа сайту",
    "Компания": "Компанія",
    "Помощь": "Допомога",
    "Политика конфиденциальности": "Політика конфіденційності",
    "о": "про",
    "с": "з",
    "Реклама на сайте": "Реклама на сайті",
    "Мобильное приложение": "Мобільний додаток",
    "Помощь по сайту": "Допомога по сайту",
    "Предложения для риелторов и агентств недвижимости": "Пропозиції для ріелторів та агентств нерухомості",
    "Безопасные сделки": "Безпечні угоди"
    }
    }
</i18n>
