<template>
    <footer class="site-footer">
        <div class="container">
            <div class="row">
                <div class="col-md-12 col-lg-4">
                    <div class="footer-logo">
                        <a href="#" title="Lionic Legal Solution" rel="home">
                            <img src="images/logo.png" alt="logo">
                        </a>
                        <p>Copyright ©2017. All Right Reserved</p>
                    </div>
                </div>
                <div class="col-md-12 col-lg-8">
                    <div class="footer-menu">
                        <div class="footer-links">
                            <ul>
                                <li><a href="#">About Us</a></li>
                                <li><a href="#">Contact Us</a></li>
                                <li><a href="#">Privacy Policy</a></li>
                                <li><a href="#">Terms Condition</a></li>
                            </ul>
                        </div>
                        <div class="social-links">
                            <ul>
                                <li class="twitter">
                                    <a href="#">
                                        <i class="fa fa-twitter fa-2x" aria-hidden="true"></i>
                                    </a>
                                </li>
                                <li class="linkedin">
                                    <a href="#">
                                        <i class="fa fa-linkedin fa-2x" aria-hidden="true"></i>
                                    </a>
                                </li>
                                <li class="email">
                                    <a href="#">
                                        <i class="fa fa-envelope-o fa-2x" aria-hidden="true"></i>
                                    </a>
                                </li>
                            </ul>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </footer>
</template>

<script>

    export default {
        name: 'footer',
        data() {
            return {
                year: (new Date()).getFullYear()
            }
        }
    }
</script>

<i18n>
    {
    "ru": {
    "Служба заботы о пользователях": "Служба заботы о пользователях",
    "Все права защищены": "Все права защищены",
    "возврата средств": "возврата средств",
    "для застройщиков": "для застройщиков",
    "Википедия": "Википедия",
    "Реклама на сайте": "Реклама на сайте",
    "Компания": "Компания",
    "Помощь": "Помощь",
    "Карта сайта": "Карта сайта",
    "о": "о",
    "с": "с",
    "Политика конфиденциальности": "Политика конфиденциальности",
    "Мобильное приложение": "Мобильное приложение",
    "Помощь по сайту": "Помощь по сайту",
    "Предложения для риелторов и агентств недвижимости": "Предложения для риелторов и агентств недвижимости",
    "Безопасные сделки": "Безопасные сделки"
    },
    "uk": {
    "Служба заботы о пользователях": "Служба турботи про користувачів",
    "Все права защищены": "Всі права захищено",
    "возврата средств": "повернення коштів",
    "для застройщиков": "для забудовників",
    "Википедия": "Вікіпедія",
    "Карта сайта": "Мапа сайту",
    "Компания": "Компанія",
    "Помощь": "Допомога",
    "Политика конфиденциальности": "Політика конфіденційності",
    "о": "про",
    "с": "з",
    "Реклама на сайте": "Реклама на сайті",
    "Мобильное приложение": "Мобільний додаток",
    "Помощь по сайту": "Допомога по сайту",
    "Предложения для риелторов и агентств недвижимости": "Пропозиції для ріелторів та агентств нерухомості",
    "Безопасные сделки": "Безпечні угоди"
    }
    }
</i18n>
