<template>
    <header></header>
</template>

<script>
    import axois from 'axios'
    import LangSwitcher from '../components/ui/LangSwitcher.vue'

    export default {
        name: 'header',
        data() {
            return {
            }
        },
        components: {
            LangSwitcher
        }
    }
</script>
<i18n>
    {
    "ru": {
    "Добавить объявление": "Добавить объявление",
    "Продажа жилья": "Продажа жилья",
    "Аренда жилья": "Аренда жилья",
    "Недвижимость": "Недвижимость",
    "Авториа - автосайт №1 Украины": "Авториа - автосайт №1 Украины",
    "Продажа и аренда недвижимости в Украине": "Продажа и аренда недвижимости в Украине",
    "Автомобили": "Автомобили",
    "Поиск": "Поиск",
    "Вход": "Вход",
    "Выход": "Выход",
    "Личный кабинет": "Личный кабинет",
    "Бесплатные объявления Украины": "Бесплатные объявления Украины",
    "Грузоперевозки": "Грузоперевозки",
    "Новостройки": "Новостройки",
    "Мои объявления": "Мои объявления",
    "Перейти в личный кабинет": "Перейти в личный кабинет",
    "urls": {
    "sell": "/ru/Каталог/Продажа/",
    "rent": "/ru/Каталог/Аренда-Помесячно/",
    "new": "/ru/Новостройки/"
    }
    },
    "uk": {
    "Добавить объявление": "Додати оголошення",
    "Продажа жилья": "Продаж житла",
    "Авториа - автосайт №1 Украины": "Авторіа - автосайт №1 України",
    "Аренда жилья": "Оренда житла",
    "Продажа и аренда недвижимости в Украине": "Продаж та оренда нерухомості в Україні",
    "Бесплатные объявления Украины": "Безкоштовні оголошення України",
    "Грузоперевозки": "Вантажоперевезення",
    "Новостройки": "Новобудови",
    "Автомобили": "Автомобілі",
    "Поиск": "Пошук",
    "Вход": "Вхід",
    "Личный кабинет": "Особистий кабінет",
    "Выход": "Вихід",
    "Мои объявления": "Мої оголошення",
    "Перейти в личный кабинет": "Перейти в особистий кабінет",
    "Недвижимость": "Нерухомість",
    "urls": {
    "sell": "/uk/Каталог/Продаж/",
    "rent": "/uk/Каталог/Оренда-Помісячно/",
    "new": "/uk/Новобудови/"
    }
    }
    }
</i18n>

