<template>
    <header class="site-header">
        <div class="container">
            <div class="row">
                <div class="site-branding col-sm-2">
                    <a href="/">Koa2Vue2 StarterKit</a>
                </div>
                <div class="col-sm-10">
                    <nav id="site-navigation" class="navbar">
                        <div class="collapse navbar-collapse navbar-ex1-collapse">
                            <ul class="nav navbar-nav navbar-right">
                                <li class="active">
                                    <a href="homepage-1.html">Home</a>
                                </li>
                                <li><a href="blog-post.html">News</a></li>
                                <li><a href="about-us.html">About Us</a></li>
                                <li><router-link :to="{ name: 'contacts', params: { lang: $i18n.locale }}">Contact Us</router-link></li>
                            </ul>
                        </div>
                    </nav>
                </div>
            </div>
        </div>
    </header>
</template>

<script>
    import LangSwitcher from '../components/ui/LangSwitcher.vue'

    export default {
        name: 'header',
        data() {
            return {
            }
        },
        components: {
            LangSwitcher
        }
    }
</script>
<i18n>
    {
    "ru": {
    "Добавить объявление": "Добавить объявление",
    "Продажа жилья": "Продажа жилья",
    "Аренда жилья": "Аренда жилья",
    "Недвижимость": "Недвижимость",
    "Авториа - автосайт №1 Украины": "Авториа - автосайт №1 Украины",
    "Продажа и аренда недвижимости в Украине": "Продажа и аренда недвижимости в Украине",
    "Автомобили": "Автомобили",
    "Поиск": "Поиск",
    "Вход": "Вход",
    "Выход": "Выход",
    "Личный кабинет": "Личный кабинет",
    "Бесплатные объявления Украины": "Бесплатные объявления Украины",
    "Грузоперевозки": "Грузоперевозки",
    "Новостройки": "Новостройки",
    "Мои объявления": "Мои объявления",
    "Перейти в личный кабинет": "Перейти в личный кабинет",
    "urls": {
    "sell": "/ru/Каталог/Продажа/",
    "rent": "/ru/Каталог/Аренда-Помесячно/",
    "new": "/ru/Новостройки/"
    }
    },
    "uk": {
    "Добавить объявление": "Додати оголошення",
    "Продажа жилья": "Продаж житла",
    "Авториа - автосайт №1 Украины": "Авторіа - автосайт №1 України",
    "Аренда жилья": "Оренда житла",
    "Продажа и аренда недвижимости в Украине": "Продаж та оренда нерухомості в Україні",
    "Бесплатные объявления Украины": "Безкоштовні оголошення України",
    "Грузоперевозки": "Вантажоперевезення",
    "Новостройки": "Новобудови",
    "Автомобили": "Автомобілі",
    "Поиск": "Пошук",
    "Вход": "Вхід",
    "Личный кабинет": "Особистий кабінет",
    "Выход": "Вихід",
    "Мои объявления": "Мої оголошення",
    "Перейти в личный кабинет": "Перейти в особистий кабінет",
    "Недвижимость": "Нерухомість",
    "urls": {
    "sell": "/uk/Каталог/Продаж/",
    "rent": "/uk/Каталог/Оренда-Помісячно/",
    "new": "/uk/Новобудови/"
    }
    }
    }
</i18n>

